{
    "intro": {
        "heading": "Make work that’s meaningful",
        "subheading": "We may be 130 years old but we've never stopped innovating",
        "logo": "white_masthead.svg",
        "heritage_logo": "ft-heritage-logo.svg"
    },
    "video": {
        "link": "https://www.ft.com/assets/product-and-tech/FT+Product+%26+Technology+Recruitment.mp4",
        "captions": "https://www.ft.com/assets/product-and-tech/ft-product-technology-recruitment.vtt"
    },
    "about": {
        "title": "Creative collaboration. 24/7",
        "text": "The FT is 130 years old but we’re an exciting, pioneering business - not stuck in the past. Our digital news relies on constant technological innovation so our projects vary in scale and scope. We’re constantly looking for new ways to improve our user experience, design and delivery."
    },
    "culture": {
        "title": "Express yourself",
        "text": "The FT is not all suits and stock markets. Far from it. You’ll be working with a positive, switched-on team to solve challenges and make great things happen. Our culture is welcoming and your unique perspective will help us build better products and an even better team.",
        "cards": [
            {
                "image": "autonomy.png",
                "title": "Autonomy",
                "text": "Our teams are small, self-governing and multi-disciplined. Working as part of our team means you’ll be empowered to choose your own tools, methodologies and frameworks to solve problems."
            },
            {
                "image": "inclusion.png",
                "title": "Inclusion",
                "text": "We don’t hire for team fit, we hire for team betterment and diverse perspectives. We also make it our priority to provide the most flexible conditions for everyone, including flexible working hours."
            },
            {
                "image": "creativity.png",
                "title": "Creativity",
                "text": "With internal Hackathons and 10% time, we welcome ideas and different approaches to improving our product."
            }
        ]
    },
    "quotes": [
        {
            "quote": "Our teams are empowered to deliver world-class products for the FT",
            "author": "Cait O’Riordan, CPIO"
        }
    ],
    "people": {
        "title": "Tech is what makes us tick",
        "text": "Our product and tech team comprises hundreds of developers, designers, product managers and analysts - but our teams are small, self-governing and multi-disciplined. It means your decisions and knowledge will count in a major way, every day.",
        "information": [
            {
                "image": "Caroline.png",
                "caption": "Caroline, Senior Research Manager"
            },
            {
                "image": "Jamie.png",
                "caption": "Jamie, Junior Engineer"
            },
            {
                "image": "Katie.png",
                "caption": "Katie, Junior Engineer"
            },
            {
                "image": "Kamran.png",
                "caption": "Kamran, Junior Integration Engineer"
            },
            {
                "image": "Miguel.png",
                "caption": "Miguel, IT Service Desk Analyst"
            },
            {
                "image": "Robin.png",
                "caption": "Robin, Head of Digital Delivery"
            }
        ]
    },
    "benefits": {
        "title": "Benefits",
        "cards": [
            {
                "title": "Career Development",
                "text": "We offer confidential career coaching, mentoring and a range of training courses, including tech talks, internal and external workshops and conferences.",
                "decoration": true
            },
            {
                "title": "Friendly, vibrant team of 400+",
                "text": "We are a cross-functional, diverse team of 400+ globally and regularly have socials such as board games night, netball, rounders, football and quiz night.",
                "decoration": false
            },
            {
                "title": "Work-life Balance",
                "text": "We make it a priority to provide flexible conditions for everyone, including flexi-leave, capacity to work from home, shared parental leave, a 35-hour work week, 10% time and more. (Location Specific)",
                "decoration": false
            },
            {
                "title": "Investing in Your Future ",
                "text": "Employees can save for the future through competitive local pension schemes, such as a double match employee pension contribution in UK. (Location Specific)",
                "decoration": false
            },
            {
                "title": "Health & Wellness",
                "text": "We offer competitive healthcare options in all regions, such as subsidised gym membership, or weekly yoga classes. (Location Specific)",
                "decoration": true
            },
            {
                "title": "Active Communities",
                "text": "Active employee led communities such as FT Women, FT Embrace (BAME Network), FT Mental Health, FT Access and Proud FT.",
                "decoration": false
            }
        ]
    },
    "apply": {
        "title": "Join the team",
        "button": "See our roles"
    },
    "openings": [
        {
            "title": "Software Engineer",
            "id": "softwareEngineer",
            "details": {
                "level": {
                    "title": "Level",
                    "text": "All"
                },
                "profession": {
                    "title": "Profession",
                    "text": "Software Engineer"
                },
                "type": {
                    "title": "Type",
                    "text": "Full time"
                },
                "location": {
                    "title": "Location",
                    "text": "London, Sofia"
                },
                "description": {
                    "title": "Description",
                    "about": [
                        "We are a multi-disciplinary, co-located team within which we periodically rotate between teams.",
                        "We value transparency, accountability, shared responsibility and teamwork. We listen to the real needs of our users and follow the FT’s mission to provide engaging world-class journalism. We ensure Engineers have the tools they need - people are free to choose the OS and device type that suits them, and we encourage exploration of new tools and techniques. We support collaboration to share skills alongside more formal training opportunities.",
                        "Most Engineers work across the entire stack, although many have expertise with particular technologies and domains, for example client-side, performance, accessibility, building APIs, security and integration. We deploy to production many times a day and have full ownership of releases, the tech we use and site reliability."
                    ],
                    "details": {
                        "responsibilities": {
                            "title": "What you’ll do…",
                            "list": [
                                "Work on new features for FT.com, our iOS and Android apps, and our presentation layer applications / services using modern web technologies.",
                                "In conjunction with other disciplines (Product Owners, UX, design and more) you’ll contribute ideas to help make decisions and achieve our clear, company-wide goals.",
                                "Maintain our high standards for web performance, security and accessibility.",
                                "Help improve the way we work and the tools we use."
                            ]
                        },
                        "requirements": {
                            "title": "This role will be right for you if…",
                            "list": [
                                "You want to use tech where your input is valued in both product and technical choices.",
                                "You prioritise a good work / life balance and rewarding work environment.",
                                "You value a clear view on the reason why you’re working on something and how its success is measured.",
                                "Your core skill set and expertise is web development and you're enthusiastic about contributing to all parts of the process.",
                                "You are keen to take action whilst being pragmatic.",
                                "You pay attention to detail and have common sense.",
                                "You love being collaborative.",
                                "You enjoy learning and teaching — whether that be pair programming, lightning talks, good documentation, leading workshops or mentoring more junior members of the team.",
                                "You love the web, and have an interest performance and accessibility.",
                                "You have an understanding of design and UX principles.",
                                "You like to avoid frameworks and only use them when necessary and right for the use case."
                            ]
                        },
                        "technologies": {
                            "title": "We often use these, it’s not an exhaustive list but gives you a taste of what our technology stack and tools look like:",
                            "list": [
                                "Node.js; Heroku; AWS: Mainly Lambda, Kinesis, Dynamo",
                                "Ad-tech stack (Google Ad Server DFP, 3rd Party Ad Servers, GPT libraries)",
                                "RESTful APIs (third-party APIs)",
                                "Elasticsearch; Neo4j; Redis; GraphQL",
                                "Handlebars; Sass; Webpack; Preact",
                                "Swift; Java; Kotlin",
                                "Fastly and VCL",
                                "GitHub; CircleCI; Sentry",
                                "Graphite; Grafana, Splunk",
                                "We do not expect you to have worked with them all but if you have experience of some of these it will be a bonus."
                            ]
                        },
                        "hiringProcess": {
                            "title": "The hiring process",
                            "list": [
                                "We understand that tech interviews are often stressful for no good reason, so we designed our interview process to be strong but friendly. It is set up to allow you to demonstrate your strengths. We have a short tech test that requires minimal code writing, a friendly in-house technical exercise and a set of standardised questions to encourage you to tell us about what you know and what you enjoy."
                            ]
                        }
                    }
                },
                "conclusion": {
                    "text": "Think this sounds like you? If you can see yourself working here and think you've got what it takes please attach your CV."
                }
            }
        },
        {
            "title": "Business Analyst",
            "id": "businessAnalyst",
            "details": {
                "level": {
                    "title": "Level",
                    "text": "All"
                },
                "profession": {
                    "title": "Profession",
                    "text": "Business Analyst"
                },
                "type": {
                    "title": "Type",
                    "text": "Full time"
                },
                "location": {
                    "title": "Location",
                    "text": "London, Sofia"
                },
                "description": {
                    "title": "Description",
                    "about": [
                        "Business Analysts at the Financial Times (FT) are central to the changes that support our continued growth.",
                        "As a BA at the FT you will naturally flex your approach to analysis depending on the stakeholders and business needs. We’re empowered to work in the best way for the work/delivery and ultimately deliver value for our colleagues, customers and the organisation as a whole. At times you will be thinking strategically and helping to set direction with the team leadership; equally you may be working in close partnership with delivery teams to get things done."
                    ],
                    "details": {
                        "requirements": {
                            "title": "This role will be right for you if…",
                            "list": [
                                "Your stakeholders love you. You build effective working relationships and mediate in meetings and discussions to accommodate different personalities.",
                                "Developers trust you. You are technically fluent and can express requirements in precise terms without losing nuance.",
                                "You’re able to rapidly understand new concepts and business areas, as well as the fundamentals of underpinning technologies.",
                                "You can communicate complexity and distill detail into clearly understandable concepts, no matter the audience.",
                                "You flourish when balancing appropriate levels of detail and shifting priorities whilst keeping an eye on outcomes, strategy and scope.",
                                "You’re an effective devil’s advocate, constructively and impartially questioning the status quo.",
                                "You love juggling multiple projects at the same time."
                            ]
                        },
                        "additionalRequirements": {
                            "title": "You have…",
                            "list": [
                                "The ability to translate business wants into needs, outputs and ultimately business value within a technology-led environment.",
                                "A wide variety of analysis and problem solving techniques to call upon.",
                                "Experience of conducting analysis in an Agile environment. You might have a background in Lean, Scrum, Kanban, UX, Anarchy, or a mix of all of the above.",
                                "Experience of working with Product Owners and stakeholders from senior level management to end-users.",
                                "The confidence to own the analysis of a problem, define the scope and present findings and recommendations to Senior stakeholders.",
                                "A knack for understanding, documenting and assessing business processes.",
                                "Experience in using data and metrics to assess the value of requirements or change requests."
                            ]
                        }
                    }
                },
                "conclusion": {
                    "text": "Think this sounds like you? If you can see yourself working here and think you've got what it takes please attach your CV."
                }
            }
        },
        {
            "title": "Delivery Manager",
            "id": "deliveryManager",
            "details": {
                "level": {
                    "title": "Level",
                    "text": "All"
                },
                "profession": {
                    "title": "Profession",
                    "text": "Delivery Manager"
                },
                "type": {
                    "title": "Type",
                    "text": "Full time"
                },
                "location": {
                    "title": "Location",
                    "text": "London"
                },
                "description": {
                    "title": "Description",
                    "about": [
                        "Our Delivery Managers sit right across our organisation - from Editorial to Sales & Marketing - and we are striving to be leaner, more nimble, effective and innovative. We can help teams do this by giving them data and tools that can not only support their processes, but also allow them to experiment on better ways to achieve their outcomes.",
                        "The successful candidate will be obsessed with value, measurement, teamwork and removing any obstacles impeding delivery. They will love communicating with people, facilitating teams, creating vision and consensus. They will also have a keen sense of stakeholder communication, engagement and creating transparency."
                    ],
                    "details": {
                        "responsibilities": {
                            "title": "Your responsibility is to drive delivery…",
                            "list": [
                                "Deliver value - Work with leadership team, business owners and teams to ensure that products & services are delivered effectively to realise measurable benefits.",
                                "Facilitate team - Resolve conflict and disagreement. Lead workshops. Remove impediments that hold your team back. Help them make decisions. Promote continuous improvement, clarity and empowerment.",
                                "Champion quality - Technical standards, service management, agile quality management practices and principles.",
                                "Create transparency - Clearly communicate and measure vision, schedule and progress within and outside of the teams.",
                                "Build good governance - Manage and monitor resources and risks, proactively plan and take corrective action where necessary.",
                                "Create vision and value - Help to define, shape and prioritise the vision, goals, initiatives and outcomes - seeking value, avoiding complexity.",
                                "Manage 3rd parties - Manage and collaborate with 3rd parties to ensure they deliver effectively and that contracts are structured appropriately.",
                                "Build community - Work to improve the FT’s Agile capability. Foster Agile knowledge, the supporting community and tools across the organisation."
                            ]
                        },
                        "requirements": {
                            "title": "This role will be right for you if…",
                            "list": [
                                "You are enthusiastic, proactive and able to resolve conflict - individuals & teams.",
                                "You are able to steer a team towards self-organisation.",
                                "You are able to quickly grasp business domains and assess genuine business value.",
                                "You are a clear, adaptive and transparent communicator.",
                                "You are bold and strategic - not afraid of failing, but afraid of not failing fast enough.",
                                "You are a proactive and an accomplished influencer - ability to negotiate with other programmes and teams to deliver work to fixed deadlines."
                            ]
                        },
                        "additionalRequirements": {
                            "title": "You have…",
                            "list": [
                                "3+ years leading and coaching Agile teams.",
                                "Strong experience and understanding of digital product development.",
                                "A good understanding of lean/agile principles and multiple methodologies.",
                                "Strong experience of coaching agile teams and individuals, workshop facilitation and structured problem solving.",
                                "Experience managing delivery using measurable business outcomes."
                            ]
                        }
                    }
                },
                "conclusion": {
                    "text": "Think this sounds like you? If you can see yourself working here and think you've got what it takes please attach your CV."
                }
            }
        },
        {
            "title": "Network Engineer",
            "id": "networkEngineer",
            "details": {
                "level": {
                    "title": "Level",
                    "text": "All"
                },
                "profession": {
                    "title": "Profession",
                    "text": "Network Engineer"
                },
                "type": {
                    "title": "Type",
                    "text": "Full time"
                },
                "location": {
                    "title": "Location",
                    "text": "London, Manila"
                },
                "description": {
                    "title": "Description",
                    "about": [
                        "This role is within Enterprise Services (ES) Networks whose mantra is ‘To enable the FT with outstanding, cost- effective technology.",
                        "Networks spans all areas of network associated services and scope, covering; local and wide-area networking; cloud services; development; security; quality assurance; integration; operational support; governance and cost controls; project management & customer/supplier management.",
                        "We believe in multi-disciplined co-located teams empowered to choose their own development methodologies. Teams typically use methodologies such as SCRUM or Kanban. Similarly most teams choose to practise Continuous Delivery or Continuous Deployment. We are constantly pushing the boundaries in the quality of the network services that support our internal users, always looking for better, simpler and more effective ways of delivery in a fast paced environment.",
                        "This role has a wide remit and includes architecting & executing the delivery of scalable, secure, and highly available network services and products for our internal customers. On a daily basis the role covers the monitoring and supporting all network services in our global offices and datacentres, connectivity into Cloud Services, delivering continual service improvement of all network services and troubleshooting problem areas as required, providing in depth network support to both support and project teams. Proactively manage and administer systems that relate to network management (including network monitoring and analysis tools as well as peripheral network services like DNS and DHCP). Supporting the wider team become more code focused will also be a key part of the role as is accelerating the move to Infrastructure-as-code.",
                        "You will also take responsibility for exposing the performance metrics and alerting on the global networks for all internal users to consume, ensuring changes and new products are being delivered with customers in mind and not just focused on feature delivery.",
                        "Collaboration with our customers is encouraged to understand their experience of the services we provide and then using that to improve and shape new products and services. Active involvement in all stages of planning of initiatives and preparing and presenting product demos at the fortnightly program showcases will help develop your interpersonal skills.",
                        "As a Network Engineer you will be using a breadth of technologies and processes to help promote quality within the Working Environments Team.",
                        "You should be passionate about delivering excellence and to achieve that we encourage self management and ownership of technical issue. So you should be tenacious in finding a resolution, working collaboratively within different teams.",
                        "As an important member of Product/Technology you will contribute to the company-wide strategies and frameworks and ensure all network components adhere to security standard. In addition, you are encouraged to participate in a number of activities such as Hackathons, coding club, lunch & learn sessions, training courses and conferences and contributing to the open source community."
                    ],
                    "details": {
                        "requirements": {
                            "title": "This role will be right for you if…",
                            "list": [
                                "You are highly capable in managing and troubleshooting in a Cisco and Checkpoint world to a senior level.",
                                "You have solid switching and routing skills and experience supporting both Layer 2 networks, and a Layer 3 LAN that closely integrates with the MAN and WAN network using BGP, OSPF and EIGRP routing protocols to provide resilience.",
                                "You have expertise in maximising performance and availability of wireless networking.",
                                "You have professional technical accreditations.",
                                "You have experience in Python or similar, with the desire to learn new languages.",
                                "You have experience with Cloud Computing e.g. IaaS, PaaS, SaaS etc.",
                                "You are familiar with a range of AWS technologies (such as Cloudformation, Lambda and EC2).",
                                "You have the ability to work with APIs.",
                                "You have experience with version control systems, e.g. Git.",
                                "You produce effective documentation to communicate anything from an idea to a strategy.",
                                "You have experience defining and implementing testing processes and procedures.",
                                "You have an understanding of agile development and its core principles.",
                                "You have a good command of written and spoken English."
                            ]
                        },
                        "additionalRequirements": {
                            "title": "These are handy, but don’t be put off if you don’t have exposure to them…",
                            "list": [
                                "Software Defined Networking",
                                "Experienced with shell scripting (bash or otherwise).",
                                "Experience working with monitoring and visibility tools (e.g. Solarwinds, Graphite/Grafana, Splunk or Zabbix).",
                                "HTML, CSS & JavaScript"
                            ]
                        }
                    }
                },
                "conclusion": {
                    "text": "Think this sounds like you? If you can see yourself working here and think you've got what it takes please attach your CV."
                }
            }
        },
        {
            "title": "Product Designer",
            "id": "productDesigner",
            "details": {
                "level": {
                    "title": "Level",
                    "text": "All"
                },
                "profession": {
                    "title": "Profession",
                    "text": "Product Designer"
                },
                "type": {
                    "title": "Type",
                    "text": "Full time"
                },
                "location": {
                    "title": "Location",
                    "text": "London"
                },
                "description": {
                    "title": "Description",
                    "about": [
                        "As a Product Designer in the FT, you will be working with our growing user experience design team in a fast and iterative product environment. We craft and evolve the quality user experience across several of our digital products across web and mobile devices and build on the success we have already gained among our growing audience of international readers.",
                        "Working collaboratively with the Principal UX and UI designers on the FT.com programme you will be creating flows, wireframes and prototypes, through to visual / UI design while working within mature UX frameworks and design system.",
                        "Our teams work using a lean methodology, this means validating design solutions quickly and being a highly collaborative and communicative team player (no rock stars please!). We design products and services to add value to our FT readers, not for ourselves. It requires working hand in hand with Product Owners, Researchers, BA’s and Developers and a willingness to both dig into details and think strategically.",
                        "Our Product Designers can lean towards UX or UI - but what we are looking for is solid UX thinkers with quality design skills who can demonstrate a clear problem solving process based around the needs of users. Please note we are not looking for Visual Designers who can do wireframes.",
                        "It’s important that you are committed to creating great product design but are pragmatic enough to test out customer-centric hypotheses quickly. Are comfortable working with analysts and product managers in assessing those ideas for likely impact, and are willing to re-evaluate your solutions when the insight isn’t in their favour."
                    ],
                    "details": {
                        "responsibilities": {
                            "title": "As a Product Designer you will be responsible for…",
                            "list": [
                                "Design features across the entire project lifecycle from ideation to launch.",
                                "You are a creative problem solver with an eye for detail and accuracy, you start any project by asking what are the behaviours and needs of the consumers we’re designing for.",
                                "Confidently work alongside Product Managers to evolve the strategy and create user centred solutions for the product.",
                                "Perform competitor analysis, review and analyse existing features, apply user-centred methods to provide ideas for improvements.",
                                "Work alongside our Research team for creating briefs for user research and testing.",
                                "Collaborate with Product Managers, Research, Engineers, and other stakeholders to solve design problems effectively and efficiently.",
                                "Run ideation workshops and design sprints.",
                                "Create user flows, journeys and pixel-perfect designs.",
                                "Produce multiple concepts and prototype interactions, and iterate based on feedback, A/B testing, user research, etc. Work alongside research to create scripts and goals for testing.",
                                "Champion consistency of the FT’s brand and products and uphold the quality of the design.",
                                "Assist with technical implementation by providing advice, mockups, prototypes, and assets."
                            ]
                        },
                        "requirements": {
                            "title": "This role will be right for you if…",
                            "list": [
                                "You are enthusiastic and eager to learn. You don’t think you’re a finished product.",
                                "You are a good communicator, this is a crucial part of what you’ll do so you need to understand how to present your UX thinking to stakeholders.",
                                "You are a solid team player. You will be highly collaborative and welcome working with others.",
                                "You are receptive to giving and receiving feedback and productive design critique."
                            ]
                        },
                        "additionalRequirements": {
                            "title": "You have…",
                            "list": [
                                "Significant expertise in user experience and user interface design.",
                                "Expertise in using Sketch, Invision, alongside knowledge of other prototyping tools.",
                                "Demonstrate your ability to create prototypes for web and mobile that provide a fantastic user experience and demonstrate your design thinking",
                                "Ability to work with existing pattern libraries/design systems.",
                                "Able to work in a lean environment."
                            ]
                        }
                    }
                },
                "conclusion": {
                    "text": "Think this sounds like you? If you can see yourself working here and think you've got what it takes please attach your CV."
                }
            }
        },
        {
            "title": "Product Manager",
            "id": "productManager",
            "details": {
                "level": {
                    "title": "Level",
                    "text": "All"
                },
                "profession": {
                    "title": "Profession",
                    "text": "Product Manager"
                },
                "type": {
                    "title": "Type",
                    "text": "Full time"
                },
                "location": {
                    "title": "Location",
                    "text": "London, Sofia"
                },
                "description": {
                    "title": "Description",
                    "about": [
                        "Digital and the web have an increasingly important role to play for the business as media consumption habits change and revenues migrate from print to online. The Product Management team are responsible for defining and delivering on a vision through to product delivery, ensuring that user needs are addressed and business goals are achieved.",
                        "A Product Manager role is available with an exciting remit of working on satisfying the needs of the FT 930,000 paid for subscribers and providing the Editorial team with front-end tools to improve storytelling and bring clarity to news.",
                        "The right person will play a key role working with stakeholders across Editorial, B2B/B2C, Ads and Data Science. You’ll be both data led and user focused with a keen eye for detail. You’ll be adept at spotting opportunities to improve our customer facing platforms; driving greater engagement among existing users while delivering new ways to tell stories. You will conduct customer research, define problems, discover insights and come up with solutions. You will work in a cross functional autonomous team that use lean methodology to deliver on outcomes."
                    ],
                    "details": {
                        "responsibilities": {
                            "title": "As a Product Manager you will be…",
                            "list": [
                                "Owning a stream of work: define the problem, set up metrics and goals and set up a course of direction.",
                                "Working in a cross functional team and lead its direction without authority.",
                                "Conduct customer research and extract insights.",
                                "Take part in finding solutions together with UX and Design.",
                                "Help developers understand the problem and come up with the best way of implementing the solution.",
                                "Working with a diverse set of stakeholders to define, champion and deliver product vision and roadmaps.",
                                "Track and analyse competitors, feeding ‘best practice’ into the product development process.",
                                "Maintain and update product backlogs and to track priorities for the digital offerings.",
                                "Working within a lean development framework.",
                                "Communicate roadmap, vision, achievements and progress to the wider team and to stakeholders."
                            ]
                        },
                        "requirements": {
                            "title": "This role will be right for you if…",
                            "list": [
                                "You have a proven track record in a product management role (2+ years).",
                                "You are data-driven and hypothesis led with ability to balance alongside user research and business objectives.",
                                "You are customer obsessed.",
                                "You have good communication skills – able to clearly write and present documents targeted at various audiences, as well as make presentations to large/small groups.",
                                "You are proactive, outcome driven, with a can-do attitude.",
                                "You are intellectually curious, with a demonstrable ability to identify opportunities and communicate their value proposition and business benefits.",
                                "You have the ability to work independently, but with regular support and collaboration with their manager.",
                                "You have the ability to balance workloads and priorities throughout the product lifecycle across of a range of email products and offsite services."
                            ]
                        },
                        "additionalRequirements": {
                            "title": "These are handy, but don’t be put off if you don’t have exposure to them…",
                            "list": [
                                "Experience of working in a data heavy environment: AB testing, segmentation, data models.",
                                "Experience in customer research."
                            ]
                        }
                    }
                },
                "conclusion": {
                    "text": "Think this sounds like you? If you can see yourself working here and think you've got what it takes please attach your CV."
                }
            }
        },
        {
            "title": "Cloud Platforms Engineer",
            "id": "platformsEngineer",
            "details": {
                "level": {
                    "title": "Level",
                    "text": "Senior"
                },
                "profession": {
                    "title": "Profession",
                    "text": "Senior Engineer - Cloud Platforms"
                },
                "type": {
                    "title": "Type",
                    "text": "Full time"
                },
                "location": {
                    "title": "Location",
                    "text": "London"
                },
                "description": {
                    "title": "Description",
                    "about": [
                        "We are looking for engineers to help us build and operate our AWS and Heroku cloud platforms effectively, thus enabling delivery teams to deliver systems quickly, safely and cost effectively."
                    ],
                    "details": {
                        "responsibilities": {
                            "title": "Your responsibility is to…",
                            "list": [
                                "Work as part of an agile team implementing modern software development practices including test automation, continuous delivery, defining infrastructure as code and application monitoring.",
                                "Collaborate with product owners and teams across the FT to understand problems and requirements.",
                                "Be responsible for the development of functionality from accepting a story through to delivery of high quality solutions into Production environments.",
                                "Understand that operating systems is just as important as building them.",
                                "Help to mentor and coach more junior members of the team in modern software development practices through pairing and training sessions.",
                                "Provide support to other delivery teams at the FT and help them utilise the cloud platforms efficiently, safely, and cost effectively."
                            ]
                        },
                        "additionalResponsibilities": {
                            "title": "You'll work on…",
                            "list": [
                                "Developing solutions that help us run and govern a large AWS and Heroku cloud estate",
                                "Providing guidance to other teams within the FT on how to use cloud platforms effectively",
                                "Providing self-service APIs and tools that enable delivery teams to utilise cloud platforms safely and effectively",
                                "Providing tools to help teams understand usage and costs of their cloud estate and encourage cost effective infrastructure"
                            ]
                        },
                        "technologies": {
                            "title": "We often use these, it’s not an exhaustive list but gives you a taste of what our technology stack and tools look like:",
                            "list": [
                                "Python 3",
                                "Pytest",
                                "Git / Github",
                                "GoCD",
                                "AWS: Lambda; Cloudformation; Config Rules; Organisations; plus the usual suspects EC2, S3, RDS",
                                "We do not expect you to have worked with them all but if you have experience of some of these it will be a bonus."
                            ]
                        },
                        "requirements": {
                            "title": "You have…",
                            "list": [
                                "Strong programming and engineering skills.",
                                "A natural bias towards test driving solution development.",
                                "Taken ownership of solutions and demonstrate technical leadership within the team.",
                                "Been responsibile for ensuring systems are available and operating well.",
                                "Experience with AWS, particularly lambda & serverless.",
                                "Setup and managed continuous integration jobs, continuous delivery pipelines and config management tools like ansible and cloudformation.",
                                "Understanding of the principles of continuous delivery & infrastructure as code.",
                                "Understanding of risk, cyber security and governance functions and building secure solutions."
                            ]
                        },
                        "additionalRequirements": {
                            "title": "Characteristics we value…",
                            "list": [
                                "Dedication to technical excellence, quality, security and reliability.",
                                "Ability to understand complex problems.",
                                "Effective communication and collaboration.",
                                "Understanding when a task is done, and steering others to complete tasks or decisions.",
                                "Ability to decide appropriately when to buy or build, and to communicate the reasons to others."
                            ]
                        },
                        "hiringProcess": {
                            "title": "The hiring process",
                            "list": [
                                "After we review your CV the next stage will be a 30 minute chat on the phone. Following this we will invite you in to meet with senior engineers and other members of the FT technology group for interviews. You will also do an onsite pair programming exercise with the aim of making it easy for you to demonstrate your strengths."
                            ]
                        }
                    }
                },
                "conclusion": {
                    "text": "Think this sounds like you? If you can see yourself working here and think you've got what it takes please attach your CV."
                }
            }
        }
    ]
}
